Revit 2026 API

# PhotometricWebLightDistribution Class

---

This class encapsulates a photometric web light distribution.

SystemObject Autodesk.Revit.DB.LightingLightDistribution Autodesk.Revit.DB.LightingPhotometricWebLightDistribution

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PhotometricWebLightDistribution : LightDistribution
```
```vb
Public Class PhotometricWebLightDistribution
	Inherits LightDistribution
```
```cpp
public ref class PhotometricWebLightDistribution : public LightDistribution
```
```fsharp
type PhotometricWebLightDistribution =
    class
        inherit LightDistribution
    end
```

The PhotometricWebLightDistribution type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | PhotometricWebLightDistribution(PhotometricWebLightDistribution) | Creates a copy of the given photometric web light distribution |
|  | PhotometricWebLightDistribution(String, Double) | Creates a photometric web light distribution object with the given filename and tilt. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from LightDistribution) |
|  | PhotometricWebFile | The filename of an IES photometric web file. |
|  | TiltAngle | The tilt angle. |

|  | Name | Description |
| --- | --- | --- |
|  | Clone | Creates a copy of the LightDistribution derived object. (Inherited from LightDistribution) |
|  | Dispose | (Inherited from LightDistribution) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Lighting Namespace